{"format": "layers-model", "generatedBy": "keras v2.7.0", "convertedBy": "TensorFlow.js Converter v3.11.0", "modelTopology": {"keras_version": "2.7.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 227, 227, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "squeezenet_input"}}, {"class_name": "Functional", "config": {"name": "squeezenet", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 227, 227, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_4"}, "name": "input_4", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1", "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "relu_conv1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "relu_conv1", "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "pool1", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "pool1", "inbound_nodes": [[["relu_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire2/squeeze1x1", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire2/squeeze1x1", "inbound_nodes": [[["pool1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire2/relu_squeeze1x1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "fire2/relu_squeeze1x1", "inbound_nodes": [[["fire2/squeeze1x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire2/expand1x1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire2/expand1x1", "inbound_nodes": [[["fire2/relu_squeeze1x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire2/expand3x3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire2/expand3x3", "inbound_nodes": [[["fire2/relu_squeeze1x1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire2/relu_expand1x1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "fire2/relu_expand1x1", "inbound_nodes": [[["fire2/expand1x1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire2/relu_expand3x3", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "fire2/relu_expand3x3", "inbound_nodes": [[["fire2/expand3x3", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "fire2/concat", "trainable": true, "dtype": "float32", "axis": 3}, "name": "fire2/concat", "inbound_nodes": [[["fire2/relu_expand1x1", 0, 0, {}], ["fire2/relu_expand3x3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire3/squeeze1x1", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire3/squeeze1x1", "inbound_nodes": [[["fire2/concat", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire3/relu_squeeze1x1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "fire3/relu_squeeze1x1", "inbound_nodes": [[["fire3/squeeze1x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire3/expand1x1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire3/expand1x1", "inbound_nodes": [[["fire3/relu_squeeze1x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire3/expand3x3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire3/expand3x3", "inbound_nodes": [[["fire3/relu_squeeze1x1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire3/relu_expand1x1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "fire3/relu_expand1x1", "inbound_nodes": [[["fire3/expand1x1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire3/relu_expand3x3", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "fire3/relu_expand3x3", "inbound_nodes": [[["fire3/expand3x3", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "fire3/concat", "trainable": true, "dtype": "float32", "axis": 3}, "name": "fire3/concat", "inbound_nodes": [[["fire3/relu_expand1x1", 0, 0, {}], ["fire3/relu_expand3x3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "pool3", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "pool3", "inbound_nodes": [[["fire3/concat", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire4/squeeze1x1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire4/squeeze1x1", "inbound_nodes": [[["pool3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire4/relu_squeeze1x1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "fire4/relu_squeeze1x1", "inbound_nodes": [[["fire4/squeeze1x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire4/expand1x1", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire4/expand1x1", "inbound_nodes": [[["fire4/relu_squeeze1x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire4/expand3x3", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire4/expand3x3", "inbound_nodes": [[["fire4/relu_squeeze1x1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire4/relu_expand1x1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "fire4/relu_expand1x1", "inbound_nodes": [[["fire4/expand1x1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire4/relu_expand3x3", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "fire4/relu_expand3x3", "inbound_nodes": [[["fire4/expand3x3", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "fire4/concat", "trainable": true, "dtype": "float32", "axis": 3}, "name": "fire4/concat", "inbound_nodes": [[["fire4/relu_expand1x1", 0, 0, {}], ["fire4/relu_expand3x3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire5/squeeze1x1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire5/squeeze1x1", "inbound_nodes": [[["fire4/concat", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire5/relu_squeeze1x1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "fire5/relu_squeeze1x1", "inbound_nodes": [[["fire5/squeeze1x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire5/expand1x1", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire5/expand1x1", "inbound_nodes": [[["fire5/relu_squeeze1x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire5/expand3x3", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire5/expand3x3", "inbound_nodes": [[["fire5/relu_squeeze1x1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire5/relu_expand1x1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "fire5/relu_expand1x1", "inbound_nodes": [[["fire5/expand1x1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire5/relu_expand3x3", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "fire5/relu_expand3x3", "inbound_nodes": [[["fire5/expand3x3", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "fire5/concat", "trainable": true, "dtype": "float32", "axis": 3}, "name": "fire5/concat", "inbound_nodes": [[["fire5/relu_expand1x1", 0, 0, {}], ["fire5/relu_expand3x3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "pool5", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "pool5", "inbound_nodes": [[["fire5/concat", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire6/squeeze1x1", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire6/squeeze1x1", "inbound_nodes": [[["pool5", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire6/relu_squeeze1x1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "fire6/relu_squeeze1x1", "inbound_nodes": [[["fire6/squeeze1x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire6/expand1x1", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire6/expand1x1", "inbound_nodes": [[["fire6/relu_squeeze1x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire6/expand3x3", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire6/expand3x3", "inbound_nodes": [[["fire6/relu_squeeze1x1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire6/relu_expand1x1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "fire6/relu_expand1x1", "inbound_nodes": [[["fire6/expand1x1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire6/relu_expand3x3", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "fire6/relu_expand3x3", "inbound_nodes": [[["fire6/expand3x3", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "fire6/concat", "trainable": true, "dtype": "float32", "axis": 3}, "name": "fire6/concat", "inbound_nodes": [[["fire6/relu_expand1x1", 0, 0, {}], ["fire6/relu_expand3x3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire7/squeeze1x1", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire7/squeeze1x1", "inbound_nodes": [[["fire6/concat", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire7/relu_squeeze1x1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "fire7/relu_squeeze1x1", "inbound_nodes": [[["fire7/squeeze1x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire7/expand1x1", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire7/expand1x1", "inbound_nodes": [[["fire7/relu_squeeze1x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire7/expand3x3", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire7/expand3x3", "inbound_nodes": [[["fire7/relu_squeeze1x1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire7/relu_expand1x1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "fire7/relu_expand1x1", "inbound_nodes": [[["fire7/expand1x1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire7/relu_expand3x3", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "fire7/relu_expand3x3", "inbound_nodes": [[["fire7/expand3x3", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "fire7/concat", "trainable": true, "dtype": "float32", "axis": 3}, "name": "fire7/concat", "inbound_nodes": [[["fire7/relu_expand1x1", 0, 0, {}], ["fire7/relu_expand3x3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire8/squeeze1x1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire8/squeeze1x1", "inbound_nodes": [[["fire7/concat", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire8/relu_squeeze1x1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "fire8/relu_squeeze1x1", "inbound_nodes": [[["fire8/squeeze1x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire8/expand1x1", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire8/expand1x1", "inbound_nodes": [[["fire8/relu_squeeze1x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire8/expand3x3", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire8/expand3x3", "inbound_nodes": [[["fire8/relu_squeeze1x1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire8/relu_expand1x1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "fire8/relu_expand1x1", "inbound_nodes": [[["fire8/expand1x1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire8/relu_expand3x3", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "fire8/relu_expand3x3", "inbound_nodes": [[["fire8/expand3x3", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "fire8/concat", "trainable": true, "dtype": "float32", "axis": 3}, "name": "fire8/concat", "inbound_nodes": [[["fire8/relu_expand1x1", 0, 0, {}], ["fire8/relu_expand3x3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire9/squeeze1x1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire9/squeeze1x1", "inbound_nodes": [[["fire8/concat", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire9/relu_squeeze1x1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "fire9/relu_squeeze1x1", "inbound_nodes": [[["fire9/squeeze1x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire9/expand1x1", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire9/expand1x1", "inbound_nodes": [[["fire9/relu_squeeze1x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fire9/expand3x3", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fire9/expand3x3", "inbound_nodes": [[["fire9/relu_squeeze1x1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire9/relu_expand1x1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "fire9/relu_expand1x1", "inbound_nodes": [[["fire9/expand1x1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "fire9/relu_expand3x3", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "fire9/relu_expand3x3", "inbound_nodes": [[["fire9/expand3x3", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "fire9/concat", "trainable": true, "dtype": "float32", "axis": 3}, "name": "fire9/concat", "inbound_nodes": [[["fire9/relu_expand1x1", 0, 0, {}], ["fire9/relu_expand3x3", 0, 0, {}]]]}], "input_layers": [["input_4", 0, 0]], "output_layers": [["fire9/concat", 0, 0]]}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_4", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "dtype": "float32", "activation": "relu"}}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_4", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}}, {"class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "dtype": "float32", "activation": "softmax"}}]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 9.999999747378752e-05, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-08, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "conv2d_4/kernel", "shape": [1, 1, 512, 4], "dtype": "float32"}, {"name": "conv2d_4/bias", "shape": [4], "dtype": "float32"}, {"name": "conv1/kernel", "shape": [3, 3, 3, 64], "dtype": "float32"}, {"name": "conv1/bias", "shape": [64], "dtype": "float32"}, {"name": "fire2/squeeze1x1/kernel", "shape": [1, 1, 64, 16], "dtype": "float32"}, {"name": "fire2/squeeze1x1/bias", "shape": [16], "dtype": "float32"}, {"name": "fire2/expand1x1/kernel", "shape": [1, 1, 16, 64], "dtype": "float32"}, {"name": "fire2/expand1x1/bias", "shape": [64], "dtype": "float32"}, {"name": "fire2/expand3x3/kernel", "shape": [3, 3, 16, 64], "dtype": "float32"}, {"name": "fire2/expand3x3/bias", "shape": [64], "dtype": "float32"}, {"name": "fire3/squeeze1x1/kernel", "shape": [1, 1, 128, 16], "dtype": "float32"}, {"name": "fire3/squeeze1x1/bias", "shape": [16], "dtype": "float32"}, {"name": "fire3/expand1x1/kernel", "shape": [1, 1, 16, 64], "dtype": "float32"}, {"name": "fire3/expand1x1/bias", "shape": [64], "dtype": "float32"}, {"name": "fire3/expand3x3/kernel", "shape": [3, 3, 16, 64], "dtype": "float32"}, {"name": "fire3/expand3x3/bias", "shape": [64], "dtype": "float32"}, {"name": "fire4/squeeze1x1/kernel", "shape": [1, 1, 128, 32], "dtype": "float32"}, {"name": "fire4/squeeze1x1/bias", "shape": [32], "dtype": "float32"}, {"name": "fire4/expand1x1/kernel", "shape": [1, 1, 32, 128], "dtype": "float32"}, {"name": "fire4/expand1x1/bias", "shape": [128], "dtype": "float32"}, {"name": "fire4/expand3x3/kernel", "shape": [3, 3, 32, 128], "dtype": "float32"}, {"name": "fire4/expand3x3/bias", "shape": [128], "dtype": "float32"}, {"name": "fire5/squeeze1x1/kernel", "shape": [1, 1, 256, 32], "dtype": "float32"}, {"name": "fire5/squeeze1x1/bias", "shape": [32], "dtype": "float32"}, {"name": "fire5/expand1x1/kernel", "shape": [1, 1, 32, 128], "dtype": "float32"}, {"name": "fire5/expand1x1/bias", "shape": [128], "dtype": "float32"}, {"name": "fire5/expand3x3/kernel", "shape": [3, 3, 32, 128], "dtype": "float32"}, {"name": "fire5/expand3x3/bias", "shape": [128], "dtype": "float32"}, {"name": "fire6/squeeze1x1/kernel", "shape": [1, 1, 256, 48], "dtype": "float32"}, {"name": "fire6/squeeze1x1/bias", "shape": [48], "dtype": "float32"}, {"name": "fire6/expand1x1/kernel", "shape": [1, 1, 48, 192], "dtype": "float32"}, {"name": "fire6/expand1x1/bias", "shape": [192], "dtype": "float32"}, {"name": "fire6/expand3x3/kernel", "shape": [3, 3, 48, 192], "dtype": "float32"}, {"name": "fire6/expand3x3/bias", "shape": [192], "dtype": "float32"}, {"name": "fire7/squeeze1x1/kernel", "shape": [1, 1, 384, 48], "dtype": "float32"}, {"name": "fire7/squeeze1x1/bias", "shape": [48], "dtype": "float32"}, {"name": "fire7/expand1x1/kernel", "shape": [1, 1, 48, 192], "dtype": "float32"}, {"name": "fire7/expand1x1/bias", "shape": [192], "dtype": "float32"}, {"name": "fire7/expand3x3/kernel", "shape": [3, 3, 48, 192], "dtype": "float32"}, {"name": "fire7/expand3x3/bias", "shape": [192], "dtype": "float32"}, {"name": "fire8/squeeze1x1/kernel", "shape": [1, 1, 384, 64], "dtype": "float32"}, {"name": "fire8/squeeze1x1/bias", "shape": [64], "dtype": "float32"}, {"name": "fire8/expand1x1/kernel", "shape": [1, 1, 64, 256], "dtype": "float32"}, {"name": "fire8/expand1x1/bias", "shape": [256], "dtype": "float32"}, {"name": "fire8/expand3x3/kernel", "shape": [3, 3, 64, 256], "dtype": "float32"}, {"name": "fire8/expand3x3/bias", "shape": [256], "dtype": "float32"}, {"name": "fire9/squeeze1x1/kernel", "shape": [1, 1, 512, 64], "dtype": "float32"}, {"name": "fire9/squeeze1x1/bias", "shape": [64], "dtype": "float32"}, {"name": "fire9/expand1x1/kernel", "shape": [1, 1, 64, 256], "dtype": "float32"}, {"name": "fire9/expand1x1/bias", "shape": [256], "dtype": "float32"}, {"name": "fire9/expand3x3/kernel", "shape": [3, 3, 64, 256], "dtype": "float32"}, {"name": "fire9/expand3x3/bias", "shape": [256], "dtype": "float32"}]}]}